import matplotlib.pyplot as plt
import math as kk


def tab_3_2(*args):
    '''

    :param args:
    :return:
    '''

    M = args[0]
    lambd_nos = args[1]
    lambd_cil = args[2]

    Cy1iz_alf_4 = [0.038, 0.04036, 0.0425, 0.0455, 0.0475, 0.05, 0.0517, 0.053, 0.055, 0.0565, 0.057, 0.0575, 0.0578,
                   0.058, 0.059, 0.0595, 0.06, 0.06, 0.06, 0.06, 0.06, 0.06, 0.06, 0.06, 0.06, 0.06, 0.06]
    Cy1iz_alf_3 = [0.038, 0.04036, 0.0425, 0.0455, 0.0475, 0.05, 0.0517, 0.053, 0.055, 0.0565, 0.057, 0.0575, 0.0575,
                   0.0577, 0.0582, 0.0585, 0.0585, 0.0585, 0.0588, 0.0588, 0.0584, 0.058, 0.0578, 0.05765, 0.0575,
                   0.05725, 0.057]
    Cy1iz_alf_2 = [0.038, 0.04036, 0.0425, 0.0455, 0.0475, 0.05, 0.0517, 0.053, 0.0545, 0.055, 0.056, 0.0563, 0.0565,
                   0.05625, 0.056, 0.0558, 0.0556, 0.0553, 0.055, 0.05475, 0.0545, 0.0542, 0.0539, 0.0535, 0.053,
                   0.05275, 0.0525]
    Cy1iz_alf_1 = [0.038, 0.04036, 0.0425, 0.0455, 0.0475, 0.049, 0.0505, 0.051, 0.052, 0.0515, 0.0508, 0.0501, 0.05,
                   0.0495, 0.049, 0.0485, 0.048, 0.04775, 0.0475, 0.04685, 0.0466, 0.0462, 0.046, 0.0455, 0.045, 0.045,
                   0.0447]
    Cy1iz_alf_05 = [0.038, 0.04036, 0.0424, 0.044, 0.0455, 0.0467, 0.047, 0.0465, 0.046, 0.0459, 0.045, 0.044, 0.0435,
                    0.043, 0.04275, 0.0425, 0.042, 0.0415, 0.041, 0.0405, 0.0403, 0.04, 0.0398, 0.0397, 0.0396, 0.03955,
                    0.0395]
    Cy1iz_alf_0 = [0.0338, 0.03373, 0.03327, 0.03336, 0.03291, 0.03281, 0.03255, 0.0325, 0.032, 0.032, 0.032, 0.032,
                   0.032, 0.032, 0.032, 0.032, 0.032, 0.032, 0.032, 0.032, 0.032, 0.032, 0.032, 0.032, 0.032, 0.032,
                   0.032]

    razm = [0, 0.1, 0.2, 0.3, 0.4, 0.5, 0.6, 0.7, 0.8, 0.9, 1, 1.1, 1.2, 1.3, 1.4, 1.5, 1.6, 1.7, 1.8, 1.9, 2, 2.1, 2.2,
            2.3, 2.4, 2.5, 2.6]

    """plt.plot(razm, Cy1iz_alf_0)
    plt.plot(razm, Cy1iz_alf_05)
    plt.plot(razm, Cy1iz_alf_1)
    plt.plot(razm, Cy1iz_alf_2)
    plt.plot(razm, Cy1iz_alf_3)
    plt.plot(razm, Cy1iz_alf_4)
    plt.axis([0, 2.6, 0, 0.065])
    plt.grid(True)
    plt.show()"""

    razmm = kk.sqrt(M ** 2 - 1) / lambd_nos
    otnos = lambd_cil / lambd_nos

    print(razmm, otnos)

    for i in range (len(razm)):
        if razmm <= razm[i]:
            if razmm >= razm[i - 1]:
                k = i
    print(razm[k - 1], razm[k])

    if otnos == 0:
        Cy1 = Cy1iz_alf_0[k]
    elif (otnos <= 0.5) and (otnos >= 0):
        Cy1 = (Cy1iz_alf_05[k] + Cy1iz_alf_0[k]) / 2
    elif (otnos <= 1) and (otnos >= 0.5):
        Cy1 = (Cy1iz_alf_1[k] + Cy1iz_alf_05[k]) / 2
    elif (otnos <= 2) and (otnos >= 1):
        Cy1 = (Cy1iz_alf_2[k] + Cy1iz_alf_1[k]) / 2
    elif (otnos <= 3) and (otnos >= 2):
        Cy1 = (Cy1iz_alf_3[k] + Cy1iz_alf_2[k]) / 2
    elif (otnos <= 4) and (otnos >= 3):
        Cy1 = (Cy1iz_alf_4[k] + Cy1iz_alf_3[k]) / 2
    else:
        Cy1 = Cy1iz_alf_4[k]

    print(Cy1)

    return Cy1


def tab_3_4(*args):

    M = args[0]
    krit = args[1]
    lambd_cil = args[2]

    Cy1iz_sph = [0.0385, 0.041, 0.043, 0.0435, 0.044, 0.0435, 0.0425, 0.042, 0.041, 0.04, 0.039, 0.038, 0.037, 0.036,
                 0.035, 0.0342, 0.0335, 0.0325, 0.032, 0.031, 0.03]
    Cy1iz_cil = [0.0365, 0.037, 0.0375, 0.0375, 0.037, 0.0365, 0.0353, 0.0345, 0.0335, 0.0325, 0.0315, 0.0305, 0.03,
                 0.0285, 0.028, 0.0275, 0.027, 0.026, 0.025, 0.0245, 0.024]
    razm = [0, 0.05, 0.1, 0.15, 0.2, 0.25, 0.3, 0.35, 0.4, 0.45, 0.5, 0.55, 0.6, 0.65, 0.7, 0.75, 0.8, 0.85, 0.9, 0.95,
            1]

    """plt.plot(razm, Cy1iz_sph)
    plt.plot(razm, Cy1iz_cil)
    plt.axis([0, 1, 0, 0.05])
    plt.grid(True)
    plt.show()"""

    razmm = kk.sqrt(M ** 2 - 1) / lambd_cil

    for i in range(len(razm)):
        if razmm <= razm[i]:
            if razmm >= razm[i - 1]:
                k = i
    print(razm[k - 1], razm[k])

    if krit == 0:
        cy1 = Cy1iz_sph[k]
    elif krit == 1:
        cy1 = Cy1iz_cil[k]

    print(cy1)

    return cy1


def tab_3_5(*args):
    Mah = args[0]
    lambd = args[1]
    c_ = args[2]
    tg_khi_05 = args[3]

    razmm = lambd * (Mah ** 2 - 1) ** 0.5
    print(razmm)
    print(lambd * tg_khi_05)
    print(lambd * c_ ** (1 / 3))

    Cy1_iz_kr_a_025 = [0.032, 0.033, 0.0342, 0.034, 0.033, 0.0313, 0.0297, 0.0278, 0.026, 0.024, 0.0225, 0.0212, 0.02,
                       0.0184, 0.0174, 0.0163, 0.0158]
    Cy1_iz_kr_a_05 = [0.032, 0.0322, 0.032, 0.031, 0.0302, 0.029, 0.0278, 0.0262, 0.0248, 0.023, 0.022, 0.0209, 0.02,
                      0.0184, 0.0174, 0.0163, 0.0158]
    Cy1_iz_kr_b_025 = [0.0292, 0.0305, 0.0316, 0.0318, 0.0312, 0.0299, 0.028, 0.0263, 0.0248, 0.023, 0.0218, 0.0206,
                       0.0197, 0.0183, 0.0173, 0.0162, 0.0157]
    Cy1_iz_kr_b_05 = [0.0298, 0.0302, 0.0302, 0.0297, 0.0288, 0.0275, 0.026, 0.0251, 0.0238, 0.0222, 0.0211, 0.0201,
                      0.0195, 0.0183, 0.0173, 0.0162, 0.0157]
    razm = [0, 0.25, 0.5, 0.75, 1, 1.25, 1.5, 1.75, 2, 2.25, 2.5, 2.75, 3, 3.25, 3.5, 3.75, 4]

    plt.plot(razm, Cy1_iz_kr_a_05)
    plt.plot(razm, Cy1_iz_kr_a_025)
    plt.axis([0, 4, 0, 0.036])
    plt.grid(True)
    plt.xlabel('Таблица для lambd * tan_0.5 = 0')
    plt.show()
    plt.plot(razm, Cy1_iz_kr_b_05)
    plt.plot(razm, Cy1_iz_kr_b_025)
    plt.axis([0, 4, 0, 0.036])
    plt.grid(True)
    plt.xlabel('Таблица для lambd * tan_0.5 = 1')
    plt.show()

    cy1 = 0.5
    return cy1

V = 650
a = 335
r = 4
r1 = 32.86
d = 14
d1 = 8
D = 72
r_ = 2 * r / d
r_1 = 2 * r1 / D
d_ = d1 / D
l_cil = 45.5 / 8
l_nos = 12.5 / 8
Mah = V / a

tan_05 = 0.307
lambd_k = 1.46
c_k = 0.03

Cy1 = tab_3_2(Mah, l_nos, l_cil)
Cy1_1 = tab_3_4(Mah, 0, l_cil)
Cy2 = tab_3_2(Mah, 1.32, 22.43)
Cy2_1 = tab_3_4(Mah, 0, 22.43)
"""
Cy1_2 = Cy1 * (1 - r_ ** 2) + Cy1_1 * r_ ** 2
print(Cy1_2)
Cy2_2 = Cy2 * (1 - r_1 ** 2) + Cy2_1 * r_1 ** 2
Cy_ob = Cy2_2 * (1 - d_ ** 2) + tab_3_4(Mah, 1, 23.75) * d_ ** 2
print(Cy_ob)
Cy_iz = Cy1_2 * (2 * r / D) ** 2 + Cy_ob

print(Cy_iz)"""

Cy1_kr = tab_3_5(Mah, lambd_k, c_k, tan_05)
